#+TITLE: May 6-17, 2019 (12 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 12
  :SPRINTSTART: <2019-05-06 Mon>
  :wpd-gandalfdwite: 1
  :wpd-manishkakoti: 1.8
  :wpd-nightwarrior-xxx: 1
  :wpd-jasonbraganza: 1.5
  :END:
** gandalfdwite
*** Read Kubernetes Docs - Part III
   :PROPERTIES:
   :ESTIMATED: 8
   :ACTUAL:
   :OWNER: gandalfdwite
   :ID: READ.1553531073
   :TASKID: READ.1553531073
   :END:
   - [ ] Cluster Administration                   ( 3h)
   - [ ] Extending Kubernetes                     ( 5h)
*** Data Structure and Algorithmic Thinking with Python - Part II
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: READ.1553531542
    :TASKID: READ.1553531542
    :END:
    - [ ] 4. Stacks                            ( 1h)
    - [ ] 5. Queues                            ( 1h)
*** Unix Concepts & Applications - Part II
   :PROPERTIES:
   :ESTIMATED: 3
   :ACTUAL:
   :OWNER: gandalfdwite
   :ID: READ.1553532278
   :TASKID: READ.1553532278
   :END:
   - [ ] 3. General Purpose Utilities            ( 1h)
   - [ ] 4. File system                          ( 2h)
** manishkakoti
*** Learn Django [0/12]
    :PROPERTIES:
    :ESTIMATED: 22
    :ACTUAL:
    :OWNER: manishkakoti
    :ID: READ.1557396756
    :TASKID: READ.1557396756
    :END:
    - [ ] Start with Django from official Documentation                            (2h)
    - [ ] Follow along other contents and explore Django                           (1h)
    - [ ] Start building demo applications in Django                               (1h)
    - [ ] Run a three-hour personal hackathon to build a miniscule application E2E (3h)
    - [ ] Watch talks on Django topics                                             (1h)
    - [ ] Revisit Django concepts and build application                            (2h)
    - [ ] Build advanced demo Django apps for practice - Part-I                    (2h)
    - [ ] Build advanced demo Django apps for practice - Part-II                   (2h)
    - [ ] Build a full-scale personal application to learn more on advanced Django (2h)
    - [ ] Build a full-scale personal application to learn more on advanced Django (2h)
    - [ ] Build a full-scale personal application to learn more on advanced Django (2h)
    - [ ] Revisit everything and closing on Django                                 (2h)
** nightwarrior-xxx
*** Website Building (Django) [3/7]
    :PROPERTIES:
    :ESTIMATED: 17
    :ACTUAL:   18.82
    :OWNER: nightwarrior-xxx
    :ID: DEV.1555953324
    :TASKID: DEV.1555953324
    :END:
    :LOGBOOK:
    CLOCK: [2019-05-03 Fri 18:30]--[2019-05-03 Fri 19:29] =>  0:59
    CLOCK: [2019-05-03 Fri 17:54]--[2019-05-03 Fri 18:17] =>  0:23
    CLOCK: [2019-05-03 Fri 11:18]--[2019-05-03 Fri 11:43] =>  0:25
    CLOCK: [2019-05-03 Fri 00:59]--[2019-05-03 Fri 01:30] =>  0:31
    CLOCK: [2019-05-02 Thu 23:32]--[2019-05-03 Fri 00:59] =>  1:27
    CLOCK: [2019-05-02 Thu 04:00]--[2019-05-02 Thu 04:39] =>  0:39
    CLOCK: [2019-05-02 Thu 02:25]--[2019-05-02 Thu 03:12] =>  0:47
    CLOCK: [2019-05-01 Wed 11:27]--[2019-05-01 Wed 11:59] =>  0:32
    CLOCK: [2019-04-30 Tue 00:23]--[2019-04-30 Tue 01:13] =>  0:50
    CLOCK: [2019-04-29 Mon 23:19]--[2019-04-29 Mon 23:51] =>  0:32
    CLOCK: [2019-04-29 Mon 22:53]--[2019-04-29 Mon 23:05] =>  0:12
    CLOCK: [2019-04-29 Mon 15:04]--[2019-04-29 Mon 15:44] =>  0:40
    CLOCK: [2019-04-29 Mon 01:50]--[2019-04-29 Mon 03:14] =>  1:24
    CLOCK: [2019-04-29 Mon 00:47]--[2019-04-29 Mon 01:19] =>  0:32
    CLOCK: [2019-04-28 Sun 23:37]--[2019-04-29 Mon 00:17] =>  0:40
    CLOCK: [2019-04-28 Sun 02:24]--[2019-04-28 Sun 02:55] =>  0:31
    CLOCK: [2019-04-28 Sun 00:53]--[2019-04-28 Sun 01:40] =>  0:47
    CLOCK: [2019-04-27 Sat 22:28]--[2019-04-27 Sat 23:01] =>  0:33
    CLOCK: [2019-04-26 Fri 18:22]--[2019-04-26 Fri 19:30] =>  1:08
    CLOCK: [2019-04-26 Fri 17:43]--[2019-04-26 Fri 18:20] =>  0:37
    CLOCK: [2019-04-26 Fri 02:18]--[2019-04-26 Fri 02:54] =>  0:36
    CLOCK: [2019-04-24 Wed 11:42]--[2019-04-24 Wed 12:10] =>  0:28
    CLOCK: [2019-04-24 Wed 04:18]--[2019-04-24 Wed 05:00] =>  0:42
    CLOCK: [2019-04-24 Wed 03:29]--[2019-04-24 Wed 04:00] =>  0:31
    CLOCK: [2019-04-24 Wed 02:12]--[2019-04-24 Wed 02:41] =>  0:29
    CLOCK: [2019-04-23 Tue 03:10]--[2019-04-23 Tue 03:31] =>  0:21
    CLOCK: [2019-04-23 Tue 02:46]--[2019-04-23 Tue 03:02] =>  0:16
    CLOCK: [2019-04-23 Tue 01:08]--[2019-04-23 Tue 01:24] =>  0:16
    CLOCK: [2019-04-23 Tue 00:58]--[2019-04-23 Tue 01:04] =>  0:06
    CLOCK: [2019-04-22 Mon 01:46]--[2019-04-22 Mon 02:25] =>  0:39
    CLOCK: [2019-04-22 Mon 00:57]--[2019-04-22 Mon 01:13] =>  0:16
    :END:
    SCHEDULED: <2019-04-22 Mon 01:00-2:00>
    SCHEDULED: <2019-04-23 Tue 01:00-2:00>
    SCHEDULED: <2019-04-24 Wed 01:00-2:00>
    SCHEDULED: <2019-04-25 Thu 01:00-2:00>
    SCHEDULED: <2019-04-26 Fri 17:30-18:30>
    SCHEDULED: <2019-04-27 Sat 22:30-23:30>
    SCHEDULED: <2019-05-30 Sun 01:00-2:00>
    SCHEDULED: <2019-05-01 Mon 01:00-2:00>
    SCHEDULED: <2019-05-02 Tue 01:00-2:00>
    SCHEDULED: <2019-05-03 Wed 01:00-2:00>
    SCHEDULED: <2019-05-04 Thu 01:00-2:00>
    SCHEDULED: <2019-05-05 Fri 01:00-2:00>
    - [X] Basics (2h)
    - [X] Product Components (2h)
    - [X] Templates (2h)
    - [ ] Bootstrap Components (3h)
    - [ ] Search Components (2h)
    - [ ] Cart Components (2h)
    - [ ] Checkout (4h)

** jasonbraganza
*** DONE Read and Practice alongside the Mastering Emacs book - Part I [4/4]
    CLOSED: [2019-05-17 Fri 13:56]
   :PROPERTIES:
   :ESTIMATED: 10
   :ACTUAL:   4.20
   :OWNER: jasonbraganza
   :ID: READ.1557143830
   :TASKID: READ.1557143830
   :END:
   :LOGBOOK:
   CLOCK: [2019-05-17 Fri 13:35]--[2019-05-17 Fri 13:56] =>  0:21
   CLOCK: [2019-05-17 Fri 13:21]--[2019-05-17 Fri 13:35] =>  0:14
   CLOCK: [2019-05-17 Fri 12:00]--[2019-05-17 Fri 12:57] =>  0:57
   CLOCK: [2019-05-16 Thu 10:03]--[2019-05-16 Thu 10:54] =>  0:51
   CLOCK: [2019-05-07 Tue 11:11]--[2019-05-07 Wed 13:00] =>  1:49
   :END:
   - [X] Introduction            (05h)
   - [X] The Way of Emacs        (05h)
   - [X] First Steps              (05h)
   - [X] The Theory of Movement   (05h)
*** DONE Read Fluent Forever and take notes - Part I [9/9]
    CLOSED: [2019-05-15 Wed 12:10]
   :PROPERTIES:
   :ESTIMATED: 6.00
   :ACTUAL:   3.52
   :OWNER: jasonbraganza
   :ID: READ.1557162821
   :TASKID: READ.1557162821
   :END:
   :LOGBOOK:
   CLOCK: [2019-05-15 Wed 12:06]--[2019-05-15 Wed 12:08] =>  0:02
   CLOCK: [2019-05-15 Wed 11:58]--[2019-05-15 Wed 12:04] =>  0:06
   CLOCK: [2019-05-15 Wed 11:49]--[2019-05-15 Wed 11:56] =>  0:07
   CLOCK: [2019-05-15 Wed 11:30]--[2019-05-15 Wed 11:48] =>  0:18
   CLOCK: [2019-05-15 Wed 11:19]--[2019-05-15 Wed 11:30] =>  0:11
   CLOCK: [2019-05-15 Wed 10:58]--[2019-05-15 Wed 11:16] =>  0:18
   CLOCK: [2019-05-15 Wed 08:59]--[2019-05-15 Wed 10:57] =>  1:58
   CLOCK: [2019-05-07 Tue 07:15]--[2019-05-07 Tue 07:46] =>  0:31
   :END:
   - [X] Introduction                                   (02h)
   - [X] Upload - The five principles to end forgetting (02h)
   - [X] Sound Play                                     (02h) 
   - [X] Word Play                                      (02h)
   - [X] Sentence Play                                  (02h)
   - [X] The Language Game                              (02h)
   - [X] Epilogue                                       (02h)
   - [X] The Toolbox                                    (02h)
   - [X] Appendices                                     (02h)
*** DONE Take Notes from Fluent Forever and formulate further actions [1/1]
    CLOSED: [2019-05-15 Wed 13:20]
   :PROPERTIES:
   :ESTIMATED: 5
   :ACTUAL:   0.75
   :OWNER: jasonbraganza
   :ID: WRITE.1557163395
   :TASKID: WRITE.1557163395
   :END:
   :LOGBOOK:
   CLOCK: [2019-05-15 Wed 12:30]--[2019-05-15 Wed 13:15] =>  0:45
   :END:
   - [X] Make Plan of action (05h)
*** DONE Work at French, in the Fluent forever app - Part I [3/3]
    CLOSED: [2019-05-17 Fri 12:05]
   :PROPERTIES:
   :ESTIMATED: 3
   :ACTUAL:   1.73
   :OWNER: jasonbraganza
   :ID: WRITE.1557903518
   :TASKID: WRITE.1557903518
   :END:
   :LOGBOOK:
   CLOCK: [2019-05-17 Fri 11:21]--[2019-05-17 Fri 12:05] =>  0:44
   CLOCK: [2019-05-16 Thu 09:42]--[2019-05-16 Thu 10:01] =>  0:19
   CLOCK: [2019-05-16 Thu 09:09]--[2019-05-16 Thu 09:15] =>  0:06
   CLOCK: [2019-05-15 Wed 14:15]--[2019-05-15 Wed 14:50] =>  0:35
   :END:
   - [X] Watched a pronunciation video. did two pronunciation lessons (1h)
   - [X] Completed 5 review sessions, 4 pronunciation lessons, 2 pronunciation videos & 4 vocabulary flashcards (1h)
   - [X] Completed 5 review sessions, 4 pronunciation lessons, 2 pronunciation videos & 4 vocabulary flashcards (1h)
